pok3r-custom/pok3r_re_firmware/firmware/demo/lib/ht32f1655_56.h
/**
 * @brief Peripheral Universal Serial Bus Endpoint
 */
typedef struct
{
                                 /* USB Endpoint0: 0x400A8014                                               */
                                 /* USB Endpoint1: 0x400A8028                                               */
                                 /* USB Endpoint2: 0x400A803C                                               */
                                 /* USB Endpoint3: 0x400A8050                                               */
                                 /* USB Endpoint4: 0x400A8064                                               */
                                 /* USB Endpoint5: 0x400A8078                                               */
                                 /* USB Endpoint6: 0x400A808C                                               */
                                 /* USB Endpoint7: 0x400A80A0                                               */
  __IO uint32_t CSR;             /*!< 0x000 USB Endpoint n Control and Status Register                      */
  __IO uint32_t IER;             /*!< 0x004 USB Endpoint n Interrupt Enable Register                        */
  __IO uint32_t ISR;             /*!< 0x008 USB Endpoint n Interrupt Status Register                        */
  __IO uint32_t TCR;             /*!< 0x00C USB Endpoint n Transfer Count Register                          */
  __IO uint32_t CFGR;            /*!< 0x010 USB Endpoint n Configuration Register                           */
} HT_USBEP_TypeDef;


/**
 * @brief External Bus Interface
 */
typedef struct
{
                                 /* EBI: 0x40098000                                                         */
  __IO uint32_t CR;              /*!< 0x000    EBI Control Register                                         */
  __IO uint32_t PCR;             /*!< 0x004    EBI Page Control Register                                    */
  __IO uint32_t SR;              /*!< 0x008    EBI Status Register                                          */
       uint32_t RESERVED0[1];    /*!< 0x00C    Reserved                                                     */
  __IO uint32_t ATR0;            /*!< 0x010    EBI Address Timing Register 0                                */
  __IO uint32_t RTR0;            /*!< 0x014    EBI Read Timing Register 0                                   */
  __IO uint32_t WTR0;            /*!< 0x018    EBI Write Timing Register 0                                  */
  __IO uint32_t PR0;             /*!< 0x01C    EBI Parity Register 0                                        */
  __IO uint32_t ATR1;            /*!< 0x020    EBI Address Timing Register 1                                */
  __IO uint32_t RTR1;            /*!< 0x024    EBI Read Timing Register 1                                   */
  __IO uint32_t WTR1;            /*!< 0x028    EBI Write Timing Register 1                                  */
  __IO uint32_t PR1;             /*!< 0x02C    EBI Parity Register 1                                        */
  __IO uint32_t ATR2;            /*!< 0x030    EBI Address Timing Register 2                                */
  __IO uint32_t RTR2;            /*!< 0x034    EBI Read Timing Register 2                                   */
  __IO uint32_t WTR2;            /*!< 0x038    EBI Write Timing Register 2                                  */
  __IO uint32_t PR2;             /*!< 0x03C    EBI Parity Register 2                                        */
  __IO uint32_t ATR3;            /*!< 0x040    EBI Address Timing Register 3                                */
  __IO uint32_t RTR3;            /*!< 0x044    EBI Read Timing Register 3                                   */
  __IO uint32_t WTR3;            /*!< 0x048    EBI Write Timing Register 3                                  */
  __IO uint32_t PR3;             /*!< 0x04C    EBI Parity Register 3                                        */
  __IO uint32_t IEN;             /*!< 0x050    EBI Interrupt Enable Register                                */
  __IO uint32_t IF;              /*!< 0x054    EBI Interrupt Flag Register                                  */
  __IO uint32_t IFC;             /*!< 0x058    EBI Interrupt Clear Register                                 */
} HT_EBI_TypeDef;


/**
 * @brief Cyclic Redundancy Check
 */
typedef struct
{
                                  /* CRC: 0x4008A000                                                        */
  __IO uint32_t CR;               /*!< 0x000 CRC Control Register                                           */
  __IO uint32_t SDR;              /*!< 0x004 CRC Seed Register                                              */
  __IO uint32_t CSR;              /*!< 0x008 CRC Checksum Register                                          */
  __IO uint32_t DR;               /*!< 0x00C CRC Data Register                                              */
} HT_CRC_TypeDef;


/**
 * @brief Integrated Interchip Sound
 */
typedef struct
{
                                  /* I2S: 0x40026000                                                        */
  __IO uint32_t CR;               /*!< 0x000 I2S Control Register                                           */
  __IO uint32_t IER;              /*!< 0x004 I2S Interrupt Enable Register                                  */
  __IO uint32_t CDR;              /*!< 0x008 I2S Clock Divider Register                                     */
  __IO uint32_t TXDR;             /*!< 0x00C I2S TX Data Register                                           */
  __IO uint32_t RXDR;             /*!< 0x010 I2S RX Data Register                                           */
  __IO uint32_t FCR;              /*!< 0x014 I2S FIFO Control Register                                      */
  __IO uint32_t SR;               /*!< 0x018 I2S Status Register                                            */
  __IO uint32_t RCNTR;            /*!< 0x01C I2S Rate Counter Register                                      */
} HT_I2S_TypeDef;


/**
  * @}
  */


/** @addtogroup Peripheral_Memory_Map
  * @{
  */

